import streamlit as st

st.set_page_config(
    initial_sidebar_state="collapsed"
)

st.subheader("2024년 청룡의 해가 밝았습니다🐉")
st.title("🙇새해복 많이 받으세요🍀")
st.subheader("저희 **우주의 기운🔮**이 여러분들의 시작을 응원합니다!")
st.write("")
st.write("")
st.write("매년 올 한 해를 어떻게 풀어나가야 할지 고민하는 당신! 잘 찾아오셨습니다!")
st.write("**'우주의 기운'** 서비스에서 2024 신년 운세를 확인하고 올 한 해를 어떻게 풀어나갈지 전략을 세워보는건 어떤가요? 운세가 아주 정확하진 않아도 약간의 길잡이는 되어드릴 수 있습니다 하핫⭐️")

st.warning("해당 서비스는 gpt-3.5-turbo 버전을 사용하고 있습니다. 생성형 AI를 사용했기 때문에 운세 풀이 결과는 전문가와 매우 다를 수 있습니다. 재미로만 즐겨주세요!")

st.divider()

st.header("서비스 소개")
st.write("20nn년에 만들어진 **'우주의 기운'** 서비스는 생성형 AI를 이용하여 2024년부터 유저들에게 신년 운세와 오늘의 운세를 풀이해주는 서비스를 제공하고 있습니다.")
st.write("현재 제공 중인 기능은 총 3가지로 **'신년 운세'**, **'오늘의 운세'**, **'오늘의 띠별 운세'** 가 있습니다.")
st.write("**신년운세🐉**에서는 '신년 총론', '재물운', '직장운', '사업운', '애정운', '건강운' 풀이를 제공하고 있습니다.")
st.write("**오늘의 운세🔆**에서는 '총론', '성공 재물운', '행운 상승'에 대한 풀이를 진행하고 있으며 '행운 상승' 풀이에서는 행운의 색상, 숫자, 방향을 알려주고 있으니 중요한 날을 앞둔 분이라면 **재미로** 확인해보신는 것을 추천드립니다😉")
st.write("**오늘의 띠별 운세🦄**에서는 1948년 이후 출생자들을 대상으로 동물띠별 운세에 대한 풀이를 제공하고 있습니다. 어떤 부분을 조심해야하는지 알려주고 있으니 관심 있으시다면 확인해보시는 것을 추천드립니다.")

